# SetHookPermission Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..SetHookPermission Method
RebarBarType Class See Also
---
Identifies if a hook type is permitted for this bar type
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetHookPermission(
	ElementId hookId,
	bool permission
)
```

Visual Basic
---
```text
Public Sub SetHookPermission ( _
	hookId As ElementId, _
	permission As Boolean _
)
```

Visual C++
---
```text
public:
void SetHookPermission(
	ElementId^ hookId,
	bool permission
)
```

# ### Parameters
hookId
    Type: Autodesk.Revit.DB..::..ElementId id of the hook type
permission
    Type: System..::..Boolean True if the hook type should be permitted for this bar type, otherwise false
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | the rebar hook type id hookId is not valid |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace